{
  "title": "The Treaty of Guadalupe Hidalgo: A Turning Point in History",
  "research_document": "\n\n--- Search Query: historical events ---\nTitle: Historic Events\nURL: https://artsandculture.google.com/category/event\nSnippet: Sign in\n\nHome\n\nExplore\n\nPlay\n\nNearby\n\nProfile\n\nThe Lab\n\nAchievements\n\nCollections\n\nThemes\n\nArtists\n\nMediums\n\nArt movements\n\nHistorical events\n\nHistorical figures\n\nPlaces\n\nAbout\n\nSettings\n\nView activity\n\nSend feedback\n\nPrivacy\n\n\n\nTerms\n\n\n\nGenerative AI Terms\n\nLoading…\n\nAll\n\nA-Z\n\nTime... A\n\nB\n\nC\n\nD\n\nE\n\nF\n\nG\n\nH\n\nI\n\nJ\n\nK\n\nL\n\nM\n\nN\n\nO\n\nP\n\nR\n\nS\n\nT\n\nU\n\nV\n\nW\n\nY\n\nZ\n\n\n\n8000BCE\n\n2000BCE\n\n500BCE\n\n500\n\n1000... 1500\n\n1700\n\n1800\n\n1850\n\n1900\n\n1920\n\n1940\n\n1960\n\n1980\n\n2000\n\nPresent\n\nTranslate with Google\n\nHome\n\nDiscover\n\nPlay\n\nNearby\n\nFavorites\n\nTitle: 26 Decade-Defining Events in U.S. History | Britannica\nURL: https://www.britannica.com/story/25-decade-defining-events-in-us-history\nSnippet: - 1820s: Monroe Doctrine (1823)\n- 1830s: Era of the Common Man (1829–37)\n- 1840s: Treaty of Guadalupe Hidalgo (1848)\n- 1850s: Dred Scott Decision (1857)\n- 1860s: Battle of Gettysburg (1863)... - 1870s: Battle of the Little Bighorn (1876)\n- 1880s: Haymarket Affair (1886)\n- 1890s: *Plessy* v. *Ferguson* (1896)\n- 1900s: Breakup of Northern Securities (1902–04)... - 1910s: Sinking of the *Lusitania* (1915)\n- 1920s: Stock Market Crash (1929)\n- 1930s: FDR’s First Fireside Chat (1933)\n- 1940s: The Atomic Bombing of Hiroshima and Nagasaki (1945)... ## 1790s: Whiskey Rebellion (1794)\n\nAs the new country began finding its feet, U.S. President George Washington sent troops to western Pennsylvania in 1794 to quell the Whiskey Rebellion, an uprising by citizens who refused to pay a liquor tax that had been imposed by Secretary of Treasury Alexander Hamilton to raise money for the national debt and to assert the power of the national government. Federalists cheered the triumph of national authority, while members of Thomas Jefferson’s Republican (later Democratic-Republican) Party were appalled by what they saw as government overreach. More than two centuries later, the names and faces have changed, but the story is ongoing.... ## 1810s: Battle of New Orleans (1815)\n\nOn January 8, 1815, a ragtag army under the command of Andrew Jackson decisively defeated British forces in the Battle of New Orleans, even though the War of 1812 had actually already ended. News of the Treaty of Ghent (December 24, 1814) had yet to reach the combatants. The American victory made a national figure of future president Jackson and contributed to the widespread perception that the U.S. had won the war, but in truth the conflict was effectively a draw, and the issues that had brought it on were largely unresolved.... ## 1840s: Treaty of Guadalupe Hidalgo (1848)\n\nSigned on February 2, 1848, the Treaty of Guadalupe Hidalgo brought to a close the Mexican-American War (1846–48) and seemingly fulfilled the Manifest Destiny of the United States championed by President James K. Polk by adding 525,000 square miles of formerly Mexican land to the U.S. territory.... ## 1850s: Dred Scott Decision (1857)\n\nThe 1850s were awash in harbingers of the American Civil War—from the Compromise of 1850, which temporarily forestalled North-South tensions, to John Brown’s Harpers Ferry Raid, which ramped them up. Arguably, though, by stoking abolitionist indignation in an increasingly polarized country, the U.S. Supreme Court’s Dred Scott decision set the table for the 1860 election of Abraham Lincoln as president, which ultimately precipitated secession and war.... ## 1860s: Battle of Gettysburg (1863)\n\nIn July 1863, the year of the Emancipation Proclamation, in the small Pennsylvania crossroads town of Gettysburg, Robert E. Lee’s invading Army of Northern Virginia sustained a defeat so devastating that it sealed the fate of the Confederacy and its “peculiar institution.” Within two years the war was over, and before the end of the decade the South was temporarily transformed by Reconstruction.... ## 1870s: Battle of the Little Bighorn (1876)\n\nWhile the country celebrated its anniversary at the Philadelphia Centennial Exposition, on June 25, 1876, the 7th Cavalry under the command of Lieutenant Colonel George Armstrong Custer was vanquished by Lakota and Northern Cheyenne warriors led by Sitting Bull in the Battle of the Little Bighorn. Although it was a major victory for the Northern Plains people against U.S. expansionism, the battle marked the beginning of the end of Native American sovereignty over the West.... ## 1910s: Sinking of the Lusitania (1915)\n\nAs World War I raged in Europe, most Americans, including U.S. President Woodrow Wilson, remained determined to avoid involvement and committed to neutrality, though the U.S. economy had benefited greatly from supplying food, raw material, and guns and ammunition to the Allies. More than any other single event, the sinking of the unarmed British ocean liner, the *Lusitania*, by a German submarine on May 7, 1915 (killing, among others, 128 Americans), prompted the U.S. to join the war on the side of the Allies.\n\nTitle: US Historical Events from 1900 to Present\nURL: https://www.baylorschool.org/uploaded/Library_Resources_PDFs/US_History_US_Historical_Events_from_1900_to_Present.pdf\nSnippet: later dies from his wounds(Sept. 14). He is succeeded by his vice president, Theodore Roosevelt.  \n1903 \nU.S. acquires Panama Canal Zone (treaty signed Nov. 17). Wright brothers make \nthe first controlled, sustained flight in heavier-than-air aircraft at Kitty Hawk, \nN.C. (Dec. 17).... 1917) three years after conflict began in 1914. Armistice ending World War I is signed (Nov. 11, 1918).  \n1914 \nPanama Canal opens to traffic (Aug. 15).  \n1915 \nFirst long distance telephone service, between New York and San Francisco, is demonstrated (Jan. 25).... 1916 \nU.S. agrees to purchase Danish West Indies (Virgin Islands) for $25 million (treaty \nsigned Aug. 14). Jeannette Rankin of Montana is the first woman elected to the U.S. House \nof Representatives (Nov. 7). \n \n \nJeannette \nRankin \n1917 \nWilson's second inauguration (March 5). First regular airmail service begins, with one round trip a day between \nWashington, DC, and New York (May 15).... 1927 \nCharles Lindbergh makes the first solo nonstop transatlantic flight in his plane The Spirit of St. \nLouis (May 20–21). \n \n \nCharles \nLindbergh \n1929 \nHerbert Hoover is inaugurated as the 31st president (March 4). Stock market crash precipitates the Great... 1938. Amelia Earhart completes first solo nonstop transatlantic flight by a woman (May 21). \n \n \nHattie Wyatt \nCaraway \n1933 \nTwentieth Amendment to the Constitution, sometimes called the ―Lame Duck Amendment,‖ is ratified, moving the \npresident's inauguration date from March 4 to Jan. 20 (Jan. 23). Franklin Roosevelt is inaugurated as the 32nd... stroke (April 12) and is succeeded by his vice president, Harry Truman. Germany \nsurrenders unconditionally (May 7). First atomic bomb is detonated at Alamogordo, \nN.M. (July 16).President Truman, Churchill, and Stalin meet at Potsdam, near Berlin,... surrender (Aug. 14). Japanese envoys sign surrender terms aboard the \nUSS Missouri in Tokyo harbor(Sept. 2). \n \n \nBomb cloud at \nHiroshima \n1945 \nUnited Nations is established (Oct. 24).  \n1946 \nThe Philippines, which had been ceded to the U.S. by Spain at the end of the Spanish-American War, becomes... Korean communists invade South Korea (June 25, 1950). President Truman, without the approval of Congress, \ncommits American troops to battle (June 27). President Truman removes Gen. Douglas MacArthur as head of \nU.S. Far East Command (April 11, 1951). Armistice agreement is signed (July 27, 1953).... Owens 4 \n \n1952 \nPuerto Rico becomes a U.S. commonwealth (July 25). First hydrogen bomb is detonated by the U.S. \non Eniwetok, an atoll in the Marshall Islands (Nov. 1).  \n1953 \nDwight Eisenhower is inaugurated as the 34th president (Jan. 20). Julius and Ethel... King, Jr., as they try to cross bridge in Selma, Ala. (March 7). President Johnson signs the Voting Rights Act, \nwhich prohibits discriminatory voting practices (Aug. 6). In six days of rioting in Watts, a black section of Los \nAngeles, 35 people are killed and 883 injured (Aug. 11–16).... 1990 \nIraqi troops invade Kuwait, leading to the Persian Gulf War(Aug. 2).... Rodney King in Los Angeles sets off several days of rioting, leading to more than 50 deaths, \nthousands of injuries and arrests, and $1 billion in property damage (April 29). President \nBush authorizes sending U.S. troops to Somalia as part of UN relief effort (Dec. 4). President... missile attack against Iraq in retaliation for alleged plot to assassinate former President \nBush (June 26). Eighteen U.S. soldiers are killed in ambush by Somali militiamen in \nMogadishu (Oct. 3–4). President Clinton signs North American Free Trade Agreement into \nlaw (Dec. 8).... and deportation of ethnic Albanians in Kosovo (March 24–June 10). School shooting at Columbine High School in \nLittleton, Colo., leaves 14 students (including the 2 shooters) and 1 teacher dead and 23 others wounded (April \n20). U.S. and China sign historic trade agreement (Nov. 15).\n\nTitle: The 100 Most Important Events in Human History\nURL: https://beckchris.com/history/the-55-most-important-events-in-human-history/\nSnippet: *Alexander becomes ruler of the Persian Empire after defeating the Persians at the Battle of Gaugamela* (Iraqi Kurdistan)\n\n— 327 BCE:\n\n*Alexander invades the Indian subcontinent* (Pakistan)\n\n— 323 BCE:\n\n*Alexander dies at Babylon* (Iraq)\n\n**14. Unification of China under Emperor Qin Shi Huang, Who Begins Building The Great Wall**: 221-206 BCE... — 1241:\n\n*The Mongols defeat an army of Poles and Moravians at the Battle of Liegnitz* (Poland)\n\n— 1258:\n\n*The Mongols capture and destroy Baghdad, capital of the Islamic Abbasid Caliphate* (Iraq)\n\n— 1260:... **35. The Ottoman Turks Take Constantinople, Marking the Fall of the Eastern Roman (Byzantine) Empire:** 1453 (Turkey)\n\n**36. Christopher Columbus Arrives in the West Indies and Claims the Land for Spain; European Conquest of the Americas Begins: **1492 (The Bahamas)... — 1510:\n\n*King Ferdinand of Spain authorizes a shipment of 50 African slaves to be sent to Santo Domingo* (Dominican Republic)\n\n— 1619:\n\n*A Dutch ship brings 20 African slaves to the British colony in Jamestown, Virginia* (US)\n\n**40. Martin Luther Sends his 95 Theses to the Archbishop of Mainz, Marking the Start of the Protestant Reformation: **1517 (Germany)... — 1801:\n\n*Oliver Evans builds the first high-pressure steam engine in the US*\n\n**51. The Holy Roman Empire, the Hapsburg Monarchy and the Polish-Lithuanian Commonwealth Join Forces to Defeat the Ottoman Turks at the Battle of Vienna, Halting Ottoman Expansion into Western Europe**: 1683 (Austria)... — 4/19/1775:\n\n*The Battles of Lexington and Concord*— 7/4/1776:\n\n*America Issues its*— 1777: **Declaration of Independence**from Great Britain\n\n*British General John Burgoyne, surrounded and unreinforced, surrenders his entire army to the Americans at the Battle of Saratoga*— 1778:... *France signs a treaty of alliance with the US*— 1781:\n\n*British General Cornwallis surrenders to George Washington, effectively ending the American Revolutionary War*— 1783:\n\n*The Treaty of Paris officially ends the war between the US and Great Britain*\n\n**56. The French Revolution: **1789-1799 (France)... *Declaration of the Rights of Man*— 1792:\n\n*Wars between Revolutionary France and European powers begin*— 1/21/1793:\n\n*King Louis XVI is beheaded*— 4/6/1793:\n\n*The Committee of Public Safety takes control, exercises dictatorial powers*— 1795:\n\n*The Directory is inaugurated*\n\n**57. The Medical Revolution:** 1796-1885 (UK; US; France)... *Brazil abolishes slavery*\n\n**: 1817-182562. Spain’s Colonies in Central and South America Fight for and Win Independence**\n\n**— 1817:**\n\n*José de San Martín defeats Chilean royalists at the Battle of Chacabuco, and enters Santiago, Chile*\n\n— 1819:... — 1821:\n\n*Bolívar’s win at the Battle of Carabobo guarantees the independence of Venezuela*\n\n— 1824:\n\n*The Battle of Ayacucho ends the Spanish presence in Peru*\n\n**63. The Invention of the Telegraph Revolutionizes Communication**: 1832-1840\n\n— 1832:... *Confederate soldiers fire on the Union garrison at Ft. Sumter in Charleston Bay*(South Carolina)\n\n— 1861:\n\n*Following the commencement of hostilities, four more states join the Confederacy*\n\n— 1/1/1863:\n\n*The*\n\n*Emancipation Proclamation frees slaves in rebel areas*... — 7/1-3/1863:\n\n*The Union victory at the Battle of Gettysburg is the turning point of the war in favor of the Union*(Pennsylvania)\n\n*— 4/9/1865:*\n\n*Confederate General Robert E. Lee surrenders the Army of Virginia to Union General Ulysses S. Grant at Appomattox Court House*(Virginia)... *—*1912:\n\n*Italy forms the colony of Italian Libya from colonies taken from the Ottoman Empire*\n\n**: 1893-192871. The Suffrage Movement: Women Fight For the Right to Vote**\n\n**1848:**\n\n*The Declaration of Sentiments, written by Elizabeth Cady Stanton and signed at the Women’s Rights Convention in Seneca Falls, NY, calls for giving women the right to vote*(US)\n\nTitle: Timelines of Big History\nURL: https://en.wikipedia.org/wiki/Timelines_of_Big_History\nSnippet: |Part of a series on|\n|--|\n|Human history|\n|↑Prehistory (Stone Age) (***Pleistocene epoch***)|\n| |\n| |\n| |\n| |\n|↓Future|\n| |\n\nThe following is a list of timeline articles:... ## Prehistory\n- For events dating from the formation of the universe see: Timeline of the universe (Chronology of the universe)\n- For events dating from the formation of the planet to the rise of modern humans see: Timeline of natural history, Timeline of the evolutionary history of life and Timeline of human evolution.\n- For events dating from the first appearance of *Homo sapiens* to before the invention of writing see: Timeline of prehistory... ## History\n\nThese **timelines of world history** detail recorded events since the creation of writing roughly 5000 years ago to the present day.\n\n- For events from c. 3200 BC – c. 500 see: Timeline of ancient history\n- For events from c. 500 – c. 1499, see: Timeline of post-classical history\n- For events from c. 1500, see: Timelines of modern history... ## Future\n- For future timelines, see: Timelines of the future\n\n## See also\n- ChronoZoom\n- Human history\n- List of years\n- List of decades, centuries, and millennia\n\nThis article includes a history-related list of lists. If an internal link incorrectly led you here, you may wish to change the link to point directly to the intended article.",
  "segments": [
    {
      "title": "The Outbreak of War",
      "text": "In April 1846, the conflict erupted when American and Mexican troops clashed on disputed land along the Rio Grande. The U.S., fostering fervent nationalism, declared war. The Mexican-American War had begun, leading to numerous battles and eventually to American occupation of Mexican territory.",
      "images": [
        "image_url_1"
      ]
    },
    {
      "title": "Consequences of the Treaty",
      "text": "The acquisition of this new territory fueled debates over slavery, contributing to the tensions that would eventually lead to the American Civil War. The U.S. expanded its borders dramatically, prompting questions about the nation's identity and morality regarding westward expansion and the treatment of Native populations.",
      "images": [
        "image_url_1"
      ]
    },
    {
      "title": "The Treaty of Guadalupe Hidalgo",
      "text": "On February 2, 1848, after two years of conflict, representatives from the United States and Mexico gathered to sign the Treaty of Guadalupe Hidalgo in a historic setting. This treaty ended the war and ceded a vast expanse of territory to the United States, including present-day California, Nevada, Utah, and parts of Arizona, New Mexico, Colorado, and Wyoming. A significant moment for both nations, it marked a pivotal turning point in U.S. history.",
      "images": [
        "image_url_1"
      ]
    },
    {
      "title": "The Background of Conflict",
      "text": "In the 1840s, tensions between the United States and Mexico rose significantly as the U.S. expanded its territory westward under the belief in Manifest Destiny. This ideology held that Americans were destined by God to spread democracy and capitalism across the North American continent. As the U.S. annexed Texas—a territory that Mexico considered its own—war became almost inevitable.",
      "images": [
        "image_url_1"
      ]
    }
  ]
}