{
  "title": "The Treaty That Shaped Two Nations: The Treaty of Guadalupe Hidalgo",
  "research_document": "\n\n--- Search Query: historical events ---\nTitle: Historic Events\nURL: https://artsandculture.google.com/category/event\nSnippet: Sign in\n\nHome\n\nExplore\n\nPlay\n\nNearby\n\nProfile\n\nThe Lab\n\nAchievements\n\nCollections\n\nThemes\n\nArtists\n\nMediums\n\nArt movements\n\nHistorical events\n\nHistorical figures\n\nPlaces\n\nAbout\n\nSettings\n\nView activity\n\nSend feedback\n\nPrivacy\n\n\n\nTerms\n\n\n\nGenerative AI Terms\n\nLoading…\n\nAll\n\nA-Z\n\nTime... A\n\nB\n\nC\n\nD\n\nE\n\nF\n\nG\n\nH\n\nI\n\nJ\n\nK\n\nL\n\nM\n\nN\n\nO\n\nP\n\nR\n\nS\n\nT\n\nU\n\nV\n\nW\n\nY\n\nZ\n\n\n\n8000BCE\n\n2000BCE\n\n500BCE\n\n500\n\n1000... 1500\n\n1700\n\n1800\n\n1850\n\n1900\n\n1920\n\n1940\n\n1960\n\n1980\n\n2000\n\nPresent\n\nTranslate with Google\n\nHome\n\nDiscover\n\nPlay\n\nNearby\n\nFavorites\n\nTitle: 26 Decade-Defining Events in U.S. History | Britannica\nURL: https://www.britannica.com/story/25-decade-defining-events-in-us-history\nSnippet: - 1820s: Monroe Doctrine (1823)\n- 1830s: Era of the Common Man (1829–37)\n- 1840s: Treaty of Guadalupe Hidalgo (1848)\n- 1850s: Dred Scott Decision (1857)\n- 1860s: Battle of Gettysburg (1863)... - 1870s: Battle of the Little Bighorn (1876)\n- 1880s: Haymarket Affair (1886)\n- 1890s: *Plessy* v. *Ferguson* (1896)\n- 1900s: Breakup of Northern Securities (1902–04)... - 1910s: Sinking of the *Lusitania* (1915)\n- 1920s: Stock Market Crash (1929)\n- 1930s: FDR’s First Fireside Chat (1933)\n- 1940s: The Atomic Bombing of Hiroshima and Nagasaki (1945)... ## 1790s: Whiskey Rebellion (1794)\n\nAs the new country began finding its feet, U.S. President George Washington sent troops to western Pennsylvania in 1794 to quell the Whiskey Rebellion, an uprising by citizens who refused to pay a liquor tax that had been imposed by Secretary of Treasury Alexander Hamilton to raise money for the national debt and to assert the power of the national government. Federalists cheered the triumph of national authority, while members of Thomas Jefferson’s Republican (later Democratic-Republican) Party were appalled by what they saw as government overreach. More than two centuries later, the names and faces have changed, but the story is ongoing.... ## 1810s: Battle of New Orleans (1815)\n\nOn January 8, 1815, a ragtag army under the command of Andrew Jackson decisively defeated British forces in the Battle of New Orleans, even though the War of 1812 had actually already ended. News of the Treaty of Ghent (December 24, 1814) had yet to reach the combatants. The American victory made a national figure of future president Jackson and contributed to the widespread perception that the U.S. had won the war, but in truth the conflict was effectively a draw, and the issues that had brought it on were largely unresolved.... ## 1840s: Treaty of Guadalupe Hidalgo (1848)\n\nSigned on February 2, 1848, the Treaty of Guadalupe Hidalgo brought to a close the Mexican-American War (1846–48) and seemingly fulfilled the Manifest Destiny of the United States championed by President James K. Polk by adding 525,000 square miles of formerly Mexican land to the U.S. territory.... ## 1850s: Dred Scott Decision (1857)\n\nThe 1850s were awash in harbingers of the American Civil War—from the Compromise of 1850, which temporarily forestalled North-South tensions, to John Brown’s Harpers Ferry Raid, which ramped them up. Arguably, though, by stoking abolitionist indignation in an increasingly polarized country, the U.S. Supreme Court’s Dred Scott decision set the table for the 1860 election of Abraham Lincoln as president, which ultimately precipitated secession and war.... ## 1860s: Battle of Gettysburg (1863)\n\nIn July 1863, the year of the Emancipation Proclamation, in the small Pennsylvania crossroads town of Gettysburg, Robert E. Lee’s invading Army of Northern Virginia sustained a defeat so devastating that it sealed the fate of the Confederacy and its “peculiar institution.” Within two years the war was over, and before the end of the decade the South was temporarily transformed by Reconstruction.... ## 1870s: Battle of the Little Bighorn (1876)\n\nWhile the country celebrated its anniversary at the Philadelphia Centennial Exposition, on June 25, 1876, the 7th Cavalry under the command of Lieutenant Colonel George Armstrong Custer was vanquished by Lakota and Northern Cheyenne warriors led by Sitting Bull in the Battle of the Little Bighorn. Although it was a major victory for the Northern Plains people against U.S. expansionism, the battle marked the beginning of the end of Native American sovereignty over the West.... ## 1910s: Sinking of the Lusitania (1915)\n\nAs World War I raged in Europe, most Americans, including U.S. President Woodrow Wilson, remained determined to avoid involvement and committed to neutrality, though the U.S. economy had benefited greatly from supplying food, raw material, and guns and ammunition to the Allies. More than any other single event, the sinking of the unarmed British ocean liner, the *Lusitania*, by a German submarine on May 7, 1915 (killing, among others, 128 Americans), prompted the U.S. to join the war on the side of the Allies.\n\nTitle: US Historical Events from 1900 to Present\nURL: https://www.baylorschool.org/uploaded/Library_Resources_PDFs/US_History_US_Historical_Events_from_1900_to_Present.pdf\nSnippet: later dies from his wounds(Sept. 14). He is succeeded by his vice president, Theodore Roosevelt.  \n1903 \nU.S. acquires Panama Canal Zone (treaty signed Nov. 17). Wright brothers make \nthe first controlled, sustained flight in heavier-than-air aircraft at Kitty Hawk, \nN.C. (Dec. 17).... 1917) three years after conflict began in 1914. Armistice ending World War I is signed (Nov. 11, 1918).  \n1914 \nPanama Canal opens to traffic (Aug. 15).  \n1915 \nFirst long distance telephone service, between New York and San Francisco, is demonstrated (Jan. 25).... 1916 \nU.S. agrees to purchase Danish West Indies (Virgin Islands) for $25 million (treaty \nsigned Aug. 14). Jeannette Rankin of Montana is the first woman elected to the U.S. House \nof Representatives (Nov. 7). \n \n \nJeannette \nRankin \n1917 \nWilson's second inauguration (March 5). First regular airmail service begins, with one round trip a day between \nWashington, DC, and New York (May 15).... 1927 \nCharles Lindbergh makes the first solo nonstop transatlantic flight in his plane The Spirit of St. \nLouis (May 20–21). \n \n \nCharles \nLindbergh \n1929 \nHerbert Hoover is inaugurated as the 31st president (March 4). Stock market crash precipitates the Great... 1938. Amelia Earhart completes first solo nonstop transatlantic flight by a woman (May 21). \n \n \nHattie Wyatt \nCaraway \n1933 \nTwentieth Amendment to the Constitution, sometimes called the ―Lame Duck Amendment,‖ is ratified, moving the \npresident's inauguration date from March 4 to Jan. 20 (Jan. 23). Franklin Roosevelt is inaugurated as the 32nd... stroke (April 12) and is succeeded by his vice president, Harry Truman. Germany \nsurrenders unconditionally (May 7). First atomic bomb is detonated at Alamogordo, \nN.M. (July 16).President Truman, Churchill, and Stalin meet at Potsdam, near Berlin,... surrender (Aug. 14). Japanese envoys sign surrender terms aboard the \nUSS Missouri in Tokyo harbor(Sept. 2). \n \n \nBomb cloud at \nHiroshima \n1945 \nUnited Nations is established (Oct. 24).  \n1946 \nThe Philippines, which had been ceded to the U.S. by Spain at the end of the Spanish-American War, becomes... Korean communists invade South Korea (June 25, 1950). President Truman, without the approval of Congress, \ncommits American troops to battle (June 27). President Truman removes Gen. Douglas MacArthur as head of \nU.S. Far East Command (April 11, 1951). Armistice agreement is signed (July 27, 1953).... Owens 4 \n \n1952 \nPuerto Rico becomes a U.S. commonwealth (July 25). First hydrogen bomb is detonated by the U.S. \non Eniwetok, an atoll in the Marshall Islands (Nov. 1).  \n1953 \nDwight Eisenhower is inaugurated as the 34th president (Jan. 20). Julius and Ethel... King, Jr., as they try to cross bridge in Selma, Ala. (March 7). President Johnson signs the Voting Rights Act, \nwhich prohibits discriminatory voting practices (Aug. 6). In six days of rioting in Watts, a black section of Los \nAngeles, 35 people are killed and 883 injured (Aug. 11–16).... 1990 \nIraqi troops invade Kuwait, leading to the Persian Gulf War(Aug. 2).... Rodney King in Los Angeles sets off several days of rioting, leading to more than 50 deaths, \nthousands of injuries and arrests, and $1 billion in property damage (April 29). President \nBush authorizes sending U.S. troops to Somalia as part of UN relief effort (Dec. 4). President... missile attack against Iraq in retaliation for alleged plot to assassinate former President \nBush (June 26). Eighteen U.S. soldiers are killed in ambush by Somali militiamen in \nMogadishu (Oct. 3–4). President Clinton signs North American Free Trade Agreement into \nlaw (Dec. 8).... and deportation of ethnic Albanians in Kosovo (March 24–June 10). School shooting at Columbine High School in \nLittleton, Colo., leaves 14 students (including the 2 shooters) and 1 teacher dead and 23 others wounded (April \n20). U.S. and China sign historic trade agreement (Nov. 15).\n\nTitle: The 100 Most Important Events in Human History\nURL: https://beckchris.com/history/the-55-most-important-events-in-human-history/\nSnippet: *Alexander becomes ruler of the Persian Empire after defeating the Persians at the Battle of Gaugamela* (Iraqi Kurdistan)\n\n— 327 BCE:\n\n*Alexander invades the Indian subcontinent* (Pakistan)\n\n— 323 BCE:\n\n*Alexander dies at Babylon* (Iraq)\n\n**14. Unification of China under Emperor Qin Shi Huang, Who Begins Building The Great Wall**: 221-206 BCE... — 1241:\n\n*The Mongols defeat an army of Poles and Moravians at the Battle of Liegnitz* (Poland)\n\n— 1258:\n\n*The Mongols capture and destroy Baghdad, capital of the Islamic Abbasid Caliphate* (Iraq)\n\n— 1260:... **35. The Ottoman Turks Take Constantinople, Marking the Fall of the Eastern Roman (Byzantine) Empire:** 1453 (Turkey)\n\n**36. Christopher Columbus Arrives in the West Indies and Claims the Land for Spain; European Conquest of the Americas Begins: **1492 (The Bahamas)... — 1510:\n\n*King Ferdinand of Spain authorizes a shipment of 50 African slaves to be sent to Santo Domingo* (Dominican Republic)\n\n— 1619:\n\n*A Dutch ship brings 20 African slaves to the British colony in Jamestown, Virginia* (US)\n\n**40. Martin Luther Sends his 95 Theses to the Archbishop of Mainz, Marking the Start of the Protestant Reformation: **1517 (Germany)... — 1801:\n\n*Oliver Evans builds the first high-pressure steam engine in the US*\n\n**51. The Holy Roman Empire, the Hapsburg Monarchy and the Polish-Lithuanian Commonwealth Join Forces to Defeat the Ottoman Turks at the Battle of Vienna, Halting Ottoman Expansion into Western Europe**: 1683 (Austria)... — 4/19/1775:\n\n*The Battles of Lexington and Concord*— 7/4/1776:\n\n*America Issues its*— 1777: **Declaration of Independence**from Great Britain\n\n*British General John Burgoyne, surrounded and unreinforced, surrenders his entire army to the Americans at the Battle of Saratoga*— 1778:... *France signs a treaty of alliance with the US*— 1781:\n\n*British General Cornwallis surrenders to George Washington, effectively ending the American Revolutionary War*— 1783:\n\n*The Treaty of Paris officially ends the war between the US and Great Britain*\n\n**56. The French Revolution: **1789-1799 (France)... *Declaration of the Rights of Man*— 1792:\n\n*Wars between Revolutionary France and European powers begin*— 1/21/1793:\n\n*King Louis XVI is beheaded*— 4/6/1793:\n\n*The Committee of Public Safety takes control, exercises dictatorial powers*— 1795:\n\n*The Directory is inaugurated*\n\n**57. The Medical Revolution:** 1796-1885 (UK; US; France)... *Brazil abolishes slavery*\n\n**: 1817-182562. Spain’s Colonies in Central and South America Fight for and Win Independence**\n\n**— 1817:**\n\n*José de San Martín defeats Chilean royalists at the Battle of Chacabuco, and enters Santiago, Chile*\n\n— 1819:... — 1821:\n\n*Bolívar’s win at the Battle of Carabobo guarantees the independence of Venezuela*\n\n— 1824:\n\n*The Battle of Ayacucho ends the Spanish presence in Peru*\n\n**63. The Invention of the Telegraph Revolutionizes Communication**: 1832-1840\n\n— 1832:... *Confederate soldiers fire on the Union garrison at Ft. Sumter in Charleston Bay*(South Carolina)\n\n— 1861:\n\n*Following the commencement of hostilities, four more states join the Confederacy*\n\n— 1/1/1863:\n\n*The*\n\n*Emancipation Proclamation frees slaves in rebel areas*... — 7/1-3/1863:\n\n*The Union victory at the Battle of Gettysburg is the turning point of the war in favor of the Union*(Pennsylvania)\n\n*— 4/9/1865:*\n\n*Confederate General Robert E. Lee surrenders the Army of Virginia to Union General Ulysses S. Grant at Appomattox Court House*(Virginia)... *—*1912:\n\n*Italy forms the colony of Italian Libya from colonies taken from the Ottoman Empire*\n\n**: 1893-192871. The Suffrage Movement: Women Fight For the Right to Vote**\n\n**1848:**\n\n*The Declaration of Sentiments, written by Elizabeth Cady Stanton and signed at the Women’s Rights Convention in Seneca Falls, NY, calls for giving women the right to vote*(US)\n\nTitle: Timelines of Big History\nURL: https://en.wikipedia.org/wiki/Timelines_of_Big_History\nSnippet: |Part of a series on|\n|--|\n|Human history|\n|↑Prehistory (Stone Age) (***Pleistocene epoch***)|\n| |\n| |\n| |\n| |\n|↓Future|\n| |\n\nThe following is a list of timeline articles:... ## Prehistory\n- For events dating from the formation of the universe see: Timeline of the universe (Chronology of the universe)\n- For events dating from the formation of the planet to the rise of modern humans see: Timeline of natural history, Timeline of the evolutionary history of life and Timeline of human evolution.\n- For events dating from the first appearance of *Homo sapiens* to before the invention of writing see: Timeline of prehistory... ## History\n\nThese **timelines of world history** detail recorded events since the creation of writing roughly 5000 years ago to the present day.\n\n- For events from c. 3200 BC – c. 500 see: Timeline of ancient history\n- For events from c. 500 – c. 1499, see: Timeline of post-classical history\n- For events from c. 1500, see: Timelines of modern history... ## Future\n- For future timelines, see: Timelines of the future\n\n## See also\n- ChronoZoom\n- Human history\n- List of years\n- List of decades, centuries, and millennia\n\nThis article includes a history-related list of lists. If an internal link incorrectly led you here, you may wish to change the link to point directly to the intended article.\n\n\n--- Search Query: Mexican-American War Treaty of Guadalupe Hidalgo 1848 ---\nTitle: Treaty of Guadalupe Hidalgo\nURL: https://en.wikipedia.org/wiki/Treaty_of_Guadalupe_Hidalgo\nSnippet: After the defeat of its army and the fall of the capital in September 1847, Mexico entered into peace negotiations with the U.S. envoy, Nicholas Trist. The resulting treaty required Mexico to cede 55 percent of its territory including the present-day states of California, Nevada, Utah, most of Colorado, New Mexico and Arizona, and a small portion of Wyoming. Mexico also relinquished all claims for Texas and recognized the Rio Grande as the southern boundary of Texas.... The United States ratified the treaty on 10 March and Mexico on 19 May. The ratifications were exchanged on 30 May, and the treaty was proclaimed on 4 July 1848.... Article XI of the treaty was important to Mexico. It provided that the United States would prevent and punish raids by Indians into Mexico, prohibited Americans from acquiring property, including livestock, taken by the Indians in those raids, and stated that the United States would return captives of the Indians to Mexico. Mexicans believed that the United States had encouraged and assisted the Comanche and Apache raids that had devastated northern Mexico in the years before the war. This article promised relief to them.... Neither side took any further action to avoid a war. Meanwhile, Polk settled a major territorial dispute with Britain via the Oregon Treaty, which was signed on 15 June 1846. By avoiding any chance of conflict with Great Britain, the United States was given a free hand regarding Mexico. After the Thornton Affair of 25–26 April, when Mexican forces attacked an American unit in the disputed area, with the result that 11 Americans were killed, five wounded, and 49 captured, Congress passed a declaration of war, which Polk signed on 13 May 1846.... The Mexican Congress responded with its own war declaration on 23 April 1846.\n\n## Conduct of war\n\nU.S. forces quickly moved beyond Texas to conquer Alta California, and New Mexico. Fighting there ended on 13 January 1847 with the signing of the \"Capitulation Agreement\" at \"Campo de Cahuenga\" and the end of the Taos Revolt. By the middle of September 1847, U.S. forces had successfully invaded central Mexico and occupied Mexico City.... The Treaty of Guadalupe Hidalgo was signed by Nicholas Trist (on behalf of the United States) and Luis G. Cuevas, Bernardo Couto, and Miguel Atristain as plenipotentiary representatives of Mexico on 2 February 1848 at the main altar of the old Basilica of Guadalupe at Villa **Hidalgo** (within the present city limits) as U.S. troops under the command of Gen. Winfield Scott were occupying Mexico City.... The treaty was subsequently ratified by the U.S. Senate by a vote of 38 to 14 on 10 March 1848 and by Mexico through a legislative vote of 51 to 34 and a Senate vote of 33 to 4, on 19 May 1848. News that New Mexico's legislative assembly had just passed an act for the organization of a U.S. territorial government helped ease Mexican concern about abandoning the people of New Mexico. The treaty was formally proclaimed on 4 July 1848.... ### Debate in the Mexican Congress\n\nThe Mexican Congress and President Manuel de la Peña y Peña met at Querétaro City in May, 1848 while Mexico City was occupied, and were now faced with the task of negotiating the treaty while dealing with separatism and anarchy spreading throughout the country. The Caste War was ongoing in Yucatán, and the insurgents in that conflict had occupied the major cities. Many states considered the federal government to be an enemy and refused to pay taxes. Meanwhile, most notably in the Federal District there was a Mexican element advocating annexation of the entire country to the United States.... It was also taken into account that Mexico could not continue the war without facing certain defeat and risking the loss of the entire country. After the commission reported its findings, the Treaty of Guadalupe Hidalgo was approved by congress. President Peña y Peña prepared decrees to prevent disorder in the capital once the occupiers left and to establish a national guard. On 26 May 1848 the government received the commissioners Nathan Clifford and Ambrose Hundley Sevier who were in Mexico to negotiate the treaty after congress had approved it with some slight modifications.... Meanwhile, the President had to deal with guerilla warfare throughout the country afflicting both the American occupiers and Mexican merchants. The aim of the guerillas was to disrupt the American supply chain from Veracruz to the capital. This was also leading to indiscriminate American reprisals. As the peace treaty was concluded and the occupiers were on the point of leaving the country, congress named Jose Joaquin Herrera to the presidency of the republic, and Peña y Peña left his post as president in exchange for the presidency of the Supreme Court on 3 June 1848. The government left Querétaro and returned to the capital.\n\nTitle: The Treaty of Guadalupe Hidalgo | National Archives\nURL: https://www.archives.gov/education/lessons/guadalupe-hidalgo\nSnippet: # The Treaty of Guadalupe Hidalgo\n\nThe Treaty of Guadalupe Hidalgo, that brought an official end to the Mexican-American War (1846-1848), was signed on February 2, 1848, at Guadalupe Hidalgo, a city north of the capital where the Mexican government had fled with the advance of U.S. forces. By its terms, Mexico ceded 55 percent of its territory, including the present-day states California, Nevada, Utah, New Mexico, most of Arizona and Colorado, and parts of Oklahoma, Kansas, and Wyoming.... ## Additional Background Information\n\nWith the defeat of its army and the fall of the capital, Mexico City, in September 1847 the Mexican government surrendered to the United States and entered into negotiations to end the war. The peace talks were negotiated by Nicholas Trist, chief clerk of the State Department, who had accompanied General Winfield Scott as a diplomat and President Polk's representative.... Trist and General Scott, after two previous unsuccessful attempts to negotiate a treaty with Santa Anna, determined that the only way to deal with Mexico was as a conquered enemy. Nicholas Trist negotiated with a special commission representing the collapsed government led by Don Bernardo Couto, Don Miguel Atristain, and Don Luis Gonzaga Cuevas of Mexico.... President Polk had recalled Trist under the belief that negotiations would be carried out with a Mexican delegation in Washington. In the six weeks it took to deliver Polk's message, Trist had received word that the Mexican government had named its special commission to negotiate. Against the president's recall, Trist determined that Washington did not understand the situation in Mexico and negotiated the peace treaty in defiance of the president.... In a December 4, 1847, letter to his wife, he wrote, \"Knowing it to be the very last chance and impressed with the dreadful consequences to our country which cannot fail to attend the loss of that chance, I decided today at noon to attempt to make a treaty; the decision is altogether my own.\"... Ignoring the president's recall command with the full knowledge that his defiance would cost him his career, Trist chose to adhere to his own principles and negotiate a treaty in violation of his instructions. His stand made him briefly a very controversial figure in the United States.... Under the terms of the treaty negotiated by Trist, Mexico ceded to the United States Upper California and New Mexico. This was known as the Mexican Cession and included present-day Arizona and New Mexico and parts of Utah, Nevada, and Colorado (see Article V of the treaty). Mexico also relinquished all claims to Texas and recognized the Rio Grande as the southern boundary with the United States (see Article V).... The United States paid Mexico $15,000,000 \"in consideration of the extension acquired by the boundaries of the United States\" (see Article XII of the treaty) and agreed to pay American citizens debts owed to them by the Mexican government (see Article XV). Other provisions included protection of property and civil rights of Mexican nationals living within the new boundaries of the United States (see Articles VIII and IX), the promise of the United States to police its boundaries (see Article XI), and compulsory arbitration of future disputes between the two countries (see Article XXI).... Trist sent a copy to Washington by the fastest means available, forcing Polk to decide whether or not to repudiate the highly satisfactory handiwork of his discredited subordinate. Polk chose to forward the treaty to the Senate. When the Senate reluctantly ratified the treaty (by a vote of 34 to 14) on March 10, 1848, it deleted Article X guaranteeing the protection of Mexican land grants. Following the ratification, U.S. troops were removed from the Mexican capital.... To carry the treaty into effect, commissioner Colonel Jon Weller and surveyor Andrew Grey were appointed by the U.S. Government, and General Pedro Conde and Sr. Jose Illarregui were appointed by the Mexican government, to survey and set the boundary. A subsequent treaty, the Gadsen Purchase, of December 30, 1853, altered the border from the initial one by adding 47 more boundary markers to the original six. Of the 53 markers, the majority were rude piles of stones; a few were of durable character with proper inscriptions.... As time passed, it became difficult to determine the exact location of the markers, with both countries claiming the originals had been moved or destroyed. To solve the problem, a convention between the two countries was concluded in the 1880s; and a survey was done that verified the need for definite demarcation of the boundary. The International Boundary Commission was created to relocate the monuments and mark the boundary line. The U.S. commissioners employed a survey photographer to record various views of each monument located and erected by the U.S. Section.... *This text was adapted from an article written by Tom Gray, a teacher at DeRuyter Central Middle School in DeRuyter, NY.*\n\n*Materials created by the National Archives and Records Administration are in the public domain. *\n\nTitle: Treaty of Guadalupe Hidalgo (1848) | National Archives\nURL: https://www.archives.gov/milestone-documents/treaty-of-guadalupe-hidalgo\nSnippet: # Treaty of Guadalupe Hidalgo (1848)\n\n**This treaty, signed on February 2, 1848, ended the war between the United States and Mexico. By its terms, Mexico ceded 55 percent of its territory, including the present-day states California, Nevada, Utah, New Mexico, most of Arizona and Colorado, and parts of Oklahoma, Kansas, and Wyoming. Mexico also relinquished all claims to Texas, and recognized the Rio Grande as the southern boundary with the United States.**... The Treaty of Guadalupe Hidalgo, which brought an official end to the Mexican-American War (1846-48), was signed on February 2, 1848, at Guadalupe Hidalgo, a city to which the Mexican government had fled with the advance of U.S. forces.... Trist sent a copy to Washington, and President Polk forwarded the treaty to the Senate for their advice and consent. When the Senate reluctantly ratified the treaty (by a vote of 34 to 14) on March 10, 1848, it removed Article X guaranteeing the protection of Mexican land grants. Following the ratification, the United States withdrew its troops from the Mexican capital.... The U.S. government paid Mexico $15 million \"in consideration of the extension acquired by the boundaries of the United States\" and agreed to pay American citizens debts owed to them by the Mexican government. Other provisions included the protection of property and civil rights of Mexican nationals living within the new boundaries of the United States, the promise of the United States to police its boundaries, and compulsory arbitration of future disputes between the two countries.... ## Transcript\n\n*TREATY OF PEACE, FRIENDSHIP, LIMITS, AND SETTLEMENT BETWEEN THE UNITED STATES OF AMERICA AND THE UNITED MEXICAN STATES CONCLUDED AT GUADALUPE HIDALGO, FEBRUARY 2, 1848; RATIFICATION ADVISED BY SENATE, WITH AMENDMENTS, MARCH 10, 1848; RATIFIED BY PRESIDENT, MARCH 16, 1848; RATIFICATIONS EXCHANGED AT QUERETARO, MAY 30, 1848; PROCLAIMED, JULY 4, 1848.*... Immediately upon the signature of this treaty, a convention shall be entered into between a commissioner or commissioners appointed by the General-in-chief of the forces of the United States, and such as may be appointed by the Mexican Government, to the end that a provisional suspension of hostilities shall take place, and that, in the places occupied by the said forces, constitutional order may be re-established, as regards the political, administrative, and judicial branches, so far as this shall be permitted by the circumstances of military occupation.... any Mexican ports and requiring the former (under the same condition) to commence, at the earliest moment practicable, withdrawing all troops of the United States then in the interior of the Mexican Republic, to points that shall be selected by common agreement, at a distance from the seaports not exceeding thirty leagues; and such evacuation of the interior of the Republic shall be completed with the least possible delay; the Mexican Government hereby binding itself to afford every facility in its power for rendering the same convenient to the troops, on their march and in their new positions, and for promoting a good understanding between them and the inhabitants.... Immediately after the exchange of ratifications of the present treaty all castles, forts, territories, places, and possessions, which have been taken or occupied by the forces of the United States during the present war, within the limits of the Mexican Republic, as about to be established by the following article, shall be definitely restored to the said Republic, together with all the artillery, arms, apparatus of war, munitions, and other public property, which were in the said castles and forts when captured, and which shall remain there at the time when this treaty shall be duly ratified by the Government of the Mexican Republic.... To this end, immediately upon the signature of this treaty, orders shall be despatched to the American officers commanding such castles and forts, securing against the removal or destruction of any such artillery, arms, apparatus of war, munitions, or other public property. The city of Mexico, within the inner line of entrenchments surrounding the said city, is comprehended in the above stipulation, as regards the restoration of artillery, apparatus of war, & c.... Mexico would be prejudicial in the extreme, it is solemnly agreed that all such incursions shall be forcibly restrained by the Government of the United States whensoever this may be necessary; and that when they cannot be prevented, they shall be punished by the said Government, and satisfaction for the same shall be exacted all in the same way, and with equal diligence and energy, as if the same incursions were meditated or committed within its own territory, against its own citizens.... The treaty of amity, commerce, and navigation, concluded at the city of Mexico, on the fifth day of April, A.\n\nTitle: Treaty of Guadalupe Hidalgo (1848) - Immigration History\nURL: https://immigrationhistory.org/item/treaty-of-guadalupe-hidalgo/\nSnippet: ### 1848\n\nIn the settlement of the Mexican-American War, this treaty formalized the United States' annexation of a major portion of northern Mexico, El Norte, and conferred citizenship on Mexicans choosing to remain in the territory.\n\n### Resources... ### Discussion Questions\n\nWhat process did the treaty of Guadalupe Hidalgo establish for the Mexican nationals living in the newly acquired U.S. territories?\n\nWhy do you think the treaty drafters anticipated possible difficulties in setting the boundary lines of California and New Mexico? You may want to refer to the map on to this page.\n\nWhat kind of political conflicts do you think arose from the inclusion of new territories and non-white communities into the United States?... ### Summary\n\nIn settlement of the Mexican-American War, this treaty formalized the United States’ annexation of a major portion of northern Mexico, including of California, Nevada, Utah, Colorado, and most of present-day New Mexico and Arizona. The treaty set the Rio Grande river as the border between Texas and Mexico and extended the United States’ territorial reach to the Pacific coast.... Mexican residents could become U.S. citizens if they chose to remain within the newly U.S. territory although their legal citizenship did not confer all the acceptance and integration of social citizenship. This territorial acquisition raised political issues in the United States regarding the westward extension of slavery and the inclusion of non-Europeans as U.S. citizens as by Asian immigrants arrived in growing numbers to the west coast.\n\nLibrary of Congress, 1847 Map of the U.S. and Mexico... ### Source\n\nArticle V\n\nThe boundary line between the two Republics shall commence in the Gulf of Mexico, three leagues from land, opposite the mouth of the Rio Grande, otherwise called Rio Bravo del Norte . . . along the whole southern boundary of New Mexico (which runs north of the town called Paso) to its western termination; thence, northward, along the western line of New Mexico . . . thence across the Rio Colorado, following the division line between Upper and Lower California, to the Pacific Ocean.... The southern and western limits of New Mexico, mentioned in the article, are those laid down in the map entitled “Map of the United Mexican States, as organized and defined by various acts of the Congress of said republic, and constructed according to the best authorities. Revised edition. Published at New York, in 1847, by J.... Disturnell,” of which map a copy is added to this treaty . . . And, in order to preclude all difficulty in tracing upon the ground the limit separating Upper from Lower California, it is agreed that the said limit shall consist of a straight line drawn from the middle of the Rio Gila, where it unites with the Colorado, to a point on the coast of the Pacific Ocean, distant one marine league due south of the southernmost point of the port of San Diego . . .... Mexicans now established in territories previously belonging to Mexico, and which remain for the future within the limits of the United States, as defined by the present treaty, shall be free to continue where they now reside, or to remove at any time to the Mexican Republic, retaining the property which they possess in the said territories, or disposing thereof, and removing the proceeds wherever they please, without their being subjected, on this account, to any contribution, tax, or charge whatever.... Those who shall prefer to remain in the said territories may either retain the title and rights of Mexican citizens, or acquire those of citizens of the United States. But they shall be under the obligation to make their election within one year from the date of the exchange of ratifications of this treaty; and those who shall remain in the said territories after the expiration of that year, without having declared their intention to retain the character of Mexicans, shall be considered to have elected to become citizens of the United States.... In the said territories, property of every kind, now belonging to Mexicans not established there, shall be inviolably respected. The present owners, the heirs of these, and all Mexicans who may hereafter acquire said property by contract, shall enjoy with respect to it guarantees equally ample as if the same belonged to citizens of the United States.... ARTICLE IX\n\nThe Mexicans who, in the territories aforesaid, shall not preserve the character of citizens of the Mexican Republic, conformably with what is stipulated in the preceding article, shall be incorporated into the Union of the United States. and be admitted at the proper time (to be judged of by the Congress of the United States) to the enjoyment of all the rights of citizens of the United States, according to the principles of the Constitution; and in the mean time, shall be maintained and protected in the free enjoyment of their liberty and property, and secured in the free exercise of their religion without restriction.\n\nTitle: Author Biography\nURL: https://www.ebsco.com/research-starters/history/analysis-treaty-guadalupe-hidalgo\nSnippet: TM\n\n# Analysis: Treaty of Guadalupe Hidalgo\n\nThe Treaty of Guadalupe Hidalgo, signed on February 2, 1848, marked a significant turning point in U.S.-Mexican relations and concluded the Mexican-American War, which had begun in May 1846. The treaty resulted in the U.S. acquiring over 525,000 square miles of territory, including present-day California, Arizona, New Mexico, Nevada, and Utah, solidifying territorial expansion efforts driven by the concept of Manifest Destiny.... President James Polk sought territorial expansion and pressed the issue, resulting in the beginning of hostilities. Although the United States forces had won all the major battles and virtually every confrontation when US diplomat Nicholas Trist arrived in mid-1847, the Mexican government refused to negotiate. However, toward the end of 1847, after another series of military defeats, including the American occupation of Mexico City, representatives of a new Mexican government accepted the invitation to negotiate and quickly reached an agreement to end the war.... That same month, Polk decided to recall Trist to Washington. In mid-November, Trist received the orders to return but refused to leave and instead continued negotiating. In January 1848, an agreement was reached, and the treaty was signed on February 2. While Polk was upset that Trist had not followed his orders, Polk did read the treaty and saw that it accomplished most of what he wanted (though the treaty gave the United States about 55 percent of Mexico, and Polk had desired more.)... The relationship reflected in this treaty made possible the Gadsden Purchase, a roughly 30,000-square-mile area occupying present-day southern Arizona and southwestern New Mexico, acquired from Mexico in late 1853.... Obviously, the initial paragraph in the extract above was not a part of the original treaty, since it contains information about the ratification process by the United States after the treaty was signed on February 2, 1848. The designation of this treaty as a “Treaty of Peace, Friendship, Limits, and Settlement” is an attempt to describe the full content and intent of the agreement.... The statement “ratified by president, March 16, 1848” indicates that President Polk had accepted the changes made by the Senate. While this was happening, Mexico was formally approving the treaty as well. The meeting with Mexican leaders in Querétaro was to fulfill article 23, which states that representatives of the two governments would meet to exchange formal copies of the ratified treaty.... Similarly, the United States claimed that in deleting article 10, it did not intend to take away the “grants of land made by Mexico.” Finally, Mexico was assured that the deletion of the last part of article 12 did not change any rights Mexico had with regard to the money that the United States was going to pay. The formal acceptance of these three changes by the Mexican foreign minister made it possible for the agreement to go into effect immediately, without the Mexican government having to repeat its ratification process.... The preamble to the treaty identifies its goal, the nations that were party to the agreement, and who had been authorized to negotiate on behalf of the two nations. The United States of America and the United Mexican States (also called the Mexican Republic) had “a sincere desire to put an end to the calamities of the war which unhappily exists between the two Republics and to establish Upon a solid basis relations of peace and friendship.”... Article 1 states the reason for the agreement: “firm and universal peace” between the two nations was the intent of both. Prior to the war, there had been military threats from both sides. Mexico had threatened war if the United States annexed Texas, which Mexico still claimed, and President Polk had put forward for the United States the idea of Manifest Destiny and began taking appropriate actions to ensure the fulfillment of this idea.... Not printed in this text, article 12 states that the American government would pay Mexico fifteen million dollars for the land being acquired and gives a schedule for the payments. (This was less than half the money that had been offered prior to the war.) In addition, article 13 states that the United States will assume payment to United States citizens for American court judgments that had been made against Mexico, a sum of no more than $3.25 million, according to article 15. Article 14 states that no further claims could be made, and article 15 clarifies the process for paying the claims.... Trist and his Mexican counterparts strove to make certain that all contingencies were covered in the treaty. It passed this test in that President Polk—who, when he received it, had already fired Trist and was looking for any flaws—accepted the treaty and sent it on to the Senate. The Mexican officials had very little choice in the major provisions of the treaty. The most important point was that the treaty did end the war, on terms desired by the United States, and allowed the United States and Mexico to enter into a more peaceful, if not always harmonious, relationship.",
  "segments": [
    {
      "title": "A War's Beginning",
      "text": "In the year 1846, tensions simmered between the United States and Mexico. The spark ignited by the annexation of Texas, which Mexico still claimed as its territory, led to conflict. The U.S. army moved into disputed lands, triggering a war that would reshape borders and destinies.",
      "images": []
    },
    {
      "title": "Negotiations and Compromise",
      "text": "With military defeat looming, the Mexican government sought peace. On February 2, 1848, representatives met at Guadalupe Hidalgo to broker a treaty. U.S. diplomat Nicholas Trist, defying orders from his government, played a pivotal role here, negotiating terms that would eventually favor the United States.",
      "images": []
    },
    {
      "title": "A New Direction",
      "text": "After the ratification of the treaty in March, the landscape of North America transformed dramatically. Mexicans living in the newly acquired territories were given the choice of retaining their Mexican citizenship or becoming U.S. citizens, a promise that came with many social complications.",
      "images": []
    },
    {
      "title": "The Battle for Mexico",
      "text": "As the conflict unfolded, U.S. forces quickly gained ground. By September 1847, the American army had captured Mexico City, striking a significant blow to the Mexican resistance. It was a decisive turn in the War, leaving the Mexican government at a crossroads.",
      "images": []
    },
    {
      "title": "A Lasting Impact",
      "text": "The Treaty of Guadalupe Hidalgo not only marked an end to the war but also fueled ongoing debates about slavery and citizenship within the United States. The conflict for land and identity continued, shaping the path for future generations in both nations.",
      "images": []
    },
    {
      "title": "The Terms of Treaty",
      "text": "The Treaty of Guadalupe Hidalgo saw Mexico cede an astonishing 55 percent of its territory, including present-day California, Nevada, Utah, New Mexico, and Arizona. In return, the U.S. agreed to pay $15 million for the land and recognized the Rio Grande as the boundary between Texas and Mexico.",
      "images": []
    }
  ]
}